{
  "symptomKey": "dysuria_urinary_retention",
  "displayName": "排尿困难与尿潴留",
  "requiredQuestions": [
    "排尿困难是急性还是慢性起病？急性尿潴留是指短时间内突然发生，慢性尿潴留是逐渐发展而来。",
    "排尿时需要增加腹压吗？严重时是否增加腹压也不能排尿？",
    "是否有下腹胀痛、膀胱区膨隆？",
    "是否有尿频、尿急、排尿踌躇、射尿无力、尿流变细、排尿间断、尿末滴沥或尿失禁？",
    "是否伴有血尿？血尿出现在排尿的哪个阶段？",
    "是否伴有下腹部绞痛，并向大腿、会阴方向放射？",
    "是否有前列腺疾病史（如前列腺增生、前列腺炎、前列腺癌）？",
    "是否有外伤史（特别是会阴区外伤、骨盆骨折、脊柱损伤）？",
    "是否有糖尿病史？是否有多饮、多尿、消瘦？",
    "是否有神经系统症状（如肢体瘫痪、感觉障碍、肌张力增高、腱反射亢进）？",
    "是否有结石病史（肾、输尿管、膀胱结石）？",
    "是否有盆腔手术史（如肛门、直肠、子宫手术）或麻醉史？",
    "是否服用某些药物（如阿托品、山莨菪碱、硝酸甘油、麻醉药）？",
    "是否有低血钾的诱因（如大量利尿、呕吐、禁食）？是否有心率快、肌无力？",
    "女性患者是否妊娠晚期？是否有子宫肌瘤、卵巢囊肿病史？",
    "是否有血液病史（如白血病、再生障碍性贫血、血友病）？",
    "是否有膀胱肿瘤史？是否出现无痛性肉眼血尿？",
    "是否有隐性脊柱裂病史？幼年时是否有长时间遗尿？",
    "是否有精神因素影响（如排尿环境不良、恐惧、疼痛拒绝排尿）？"
  ],
  "associatedSymptoms": [
    "伴尿频、尿急、排尿踌躇、射尿无力、尿流变细、排尿间断、尿末滴沥、尿失禁（见于良性前列腺增生）",
    "伴下腹部绞痛并向大腿、会阴方向放射（见于膀胱颈部结石）",
    "伴血尿（见于后尿道损伤、膀胱颈部结石、血液病如血友病等）",
    "伴脊髓损伤表现（如脊柱骨折、肿瘤压迫、结核、脊髓炎等引起运动和感觉障碍、截瘫）",
    "伴血糖、尿糖升高（见于糖尿病神经源性膀胱）",
    "伴低血钾表现（如肌无力、心率快、心电图病理性U波）",
    "伴膀胱刺激征（尿频、尿急、尿痛）和发热（可能合并感染）",
    "伴排便功能紊乱（如便秘、大便失禁，见于神经源性膀胱）",
    "伴慢性咳嗽、气促（慢性阻塞性肺疾病导致腹压增高）",
    "伴盆腔脏器脱出感（女性膀胱脱出）"
  ],
  "redFlags": [
    "急性尿潴留伴膀胱区剧烈胀痛、膨隆（需紧急导尿处理）",
    "排尿困难伴无痛性肉眼血尿（警惕膀胱肿瘤）",
    "排尿困难伴脊髓损伤体征（如截瘫、感觉障碍，提示神经源性膀胱，需神经科紧急评估）",
    "排尿困难伴高热、寒战、腰痛（警惕急性肾盂肾炎或前列腺脓肿）",
    "排尿困难伴严重外伤史（如骨盆骨折、脊柱损伤，可能合并尿道断裂或脊髓损伤）",
    "排尿困难伴进行性神经功能恶化（如肌无力、感觉缺失，警惕脊髓压迫症）",
    "慢性尿潴留伴反复泌尿系感染、肾积水（可能导致肾功能损害）",
    "排尿困难伴顽固性低血钾（需排查肾小管酸中毒、甲状腺功能亢进等）",
    "老年男性排尿困难短期内迅速加重，伴骨痛、贫血（警惕前列腺癌转移）",
    "排尿困难伴意识障碍、休克（可能为严重感染、糖尿病酮症酸中毒等全身性疾病）"
  ],
  "physicalSigns": [
    "膀胱区视诊及触诊：有无膨隆、压痛，叩诊是否呈浊音（尿潴留）",
    "直肠指检（男性）：前列腺大小、质地、表面光滑度、有无结节、压痛（前列腺增生、前列腺癌、前列腺炎）",
    "尿道口检查：有无狭窄、结石、异物、分泌物",
    "神经系统检查：肌力、肌张力、腱反射、病理反射、会阴部感觉（评估脊髓损伤或神经源性膀胱）",
    "骨盆及脊柱检查：有无畸形、压痛（骨折、脊柱裂）",
    "妇科检查（女性）：有无子宫肌瘤、卵巢囊肿、膀胱脱出",
    "生命体征：有无发热、心率增快（感染、低血钾）",
    "腹部检查：有无手术疤痕、肿块（肿瘤、妊娠子宫）",
    "观察排尿过程：尿流粗细、射程、中断情况",
    "测量残余尿量（导尿或膀胱超声）",
    "实验室检查：尿常规（血尿、脓尿）、血糖、血钾、前列腺特异性抗原（PSA）",
    "影像学检查：B超（膀胱残余尿、结石、肿瘤）、X线（脊柱裂、结石）、尿道造影（尿道损伤）"
  ]
}