{
  "symptomKey": "emaciation",
  "displayName": "消瘦",
  "requiredQuestions": [
    "体重下降了多少？是否低于标准体重的10%（或BMI<18.5kg/m²）？",
    "体重下降是短期内发生还是长期逐渐出现？",
    "是否有吞咽困难？（可能提示口腔、咽、食管或神经肌肉疾病）",
    "是否有食欲不振、恶心、呕吐、腹胀、腹痛或腹泻？",
    "是否有上腹部不适、隐痛或嗳气？（可能提示胃、十二指肠、胆囊、胰腺疾病）",
    "是否有下腹部不适或疼痛？（可能提示肠道疾病）",
    "是否有黄疸？（提示肝、胆、胰疾病）",
    "是否有便血？（可能提示炎症性肠病、肝硬化、胃癌等）",
    "是否有咯血？（提示肺结核、肺癌等）",
    "是否有发热？（提示慢性感染、结核、肿瘤）",
    "是否有多尿、多饮、多食？（提示糖尿病）",
    "是否有畏热、多汗、心悸、手抖、情绪急躁？（提示甲状腺功能亢进症）",
    "是否有皮肤黏膜色素沉着、乏力、低血压、厌食？（提示肾上腺皮质功能减退症）",
    "女性是否有产后大出血史，伴性功能减退、闭经、毛发脱落？（提示希恩综合征）",
    "是否有情绪低落、自卑、食欲不振、睡眠障碍？（提示抑郁症或神经性厌食）",
    "是否有慢性咳嗽、盗汗、乏力？（提示结核病）",
    "是否有其他慢性疾病史（如糖尿病、甲状腺疾病、慢性肝肾疾病、肿瘤）？",
    "是否有主动减肥行为（限制饮食、服用减肥药、过度运动）？",
    "是否有家族性消瘦史？"
  ],
  "associatedSymptoms": [
    "伴有吞咽困难（见于口、咽及食管疾病）",
    "伴有上腹部不适、疼痛（见于慢性胃炎、溃疡病、胃癌及胆囊、胰腺等疾病）",
    "伴有下腹部不适、疼痛（见于慢性肠炎、慢性痢疾、肠结核及肿瘤等）",
    "伴有上腹隐痛、嗳气（见于溃疡病、胃癌等）",
    "伴有黄疸（见于肝、胆、胰等疾病）",
    "伴有腹泻（见于慢性肠炎、慢性痢疾、肠结核、短肠综合征、倾倒综合征及乳糖酶缺乏症等）",
    "伴有便血（见于炎症性肠病、肝硬化、胃癌等）",
    "伴有咯血（见于肺结核、肺癌等）",
    "伴有发热（见于慢性感染、肺结核及肿瘤等）",
    "伴有多尿、多饮、多食（见于糖尿病）",
    "伴有畏寒、多汗、心悸、震颤多动（见于甲状腺功能亢进症）",
    "伴有皮肤黏膜色素沉着、低血压（见于肾上腺皮质功能减退症）",
    "伴有情绪低落、自卑、食欲不振（见于抑郁症）",
    "伴有性功能减退、闭经、毛发脱落（见于希恩综合征）",
    "伴有慢性咳嗽、盗汗、乏力（见于结核病）"
  ],
  "redFlags": [
    "短期内体重急剧下降（如1个月内下降>5%），尤其伴不明原因发热、盗汗（警惕恶性肿瘤、结核、HIV感染等）",
    "消瘦伴进行性吞咽困难、胸骨后疼痛（警惕食管癌、贲门癌）",
    "消瘦伴无痛性黄疸、上腹包块（警惕胰腺癌、胆道肿瘤、肝癌）",
    "消瘦伴便血、黑便或粪便隐血阳性（警惕胃癌、结肠癌、炎症性肠病）",
    "消瘦伴咯血、胸痛、呼吸困难（警惕肺癌、肺结核）",
    "消瘦伴严重腹泻、脂肪泻、营养不良（警惕慢性胰腺炎、胰腺癌、乳糜泻、短肠综合征）",
    "消瘦伴意识障碍、低血压、低血糖（警惕肾上腺皮质功能减退危象）",
    "消瘦伴高血糖、酮症酸中毒表现（如深大呼吸、嗜睡，警惕糖尿病酮症酸中毒）",
    "消瘦伴甲状腺肿大、突眼、心律失常、心力衰竭（警惕甲状腺功能亢进危象）",
    "消瘦伴精神行为异常、自杀倾向（警惕重度抑郁症、神经性厌食导致恶病质）",
    "儿童或青少年消瘦伴生长迟缓、发育停滞（警惕慢性疾病、内分泌疾病、遗传代谢病）",
    "消瘦伴全身水肿、低蛋白血症（警惕肾病综合征、肝硬化失代偿期）",
    "消瘦伴免疫力低下、反复感染（警惕HIV感染、血液系统恶性肿瘤）"
  ],
  "physicalSigns": [
    "测量身高、体重，计算体重指数（BMI）和标准体重百分比",
    "评估营养状况：有无肌肉萎缩、皮下脂肪减少、皮肤弹性差",
    "检查生命体征：体温（有无发热）、血压（有无低血压）、心率（有无心动过速或过缓）",
    "皮肤检查：有无色素沉着（尤其皱褶处）、苍白、黄疸、干燥、皮疹",
    "甲状腺检查：有无肿大、结节、触痛、血管杂音",
    "腹部检查：有无压痛、包块、肝脾肿大、腹水征",
    "淋巴结检查：有无全身或局部淋巴结肿大",
    "口腔及咽喉检查：有无溃疡、炎症、肿块",
    "神经系统检查：有无肌力下降、感觉异常（如神经性厌食、重症肌无力、延髓性麻痹）",
    "精神心理状态评估：有无情绪低落、焦虑、认知功能下降",
    "女性生殖系统评估：有无阴毛脱落、乳房萎缩",
    "胸部检查：有无呼吸音异常、啰音（肺结核、肺炎）"
  ]
}