{
  "symptomKey": "fever",
  "displayName": "发热",
  "requiredQuestions": [
    "发热的体温是多少？（低热37.3-38℃；中等度热38.1-39℃；高热39.1-41℃；超高热>41℃）",
    "发热是何时开始的？是持续发热还是间歇性发热？",
    "发热的热型是什么？（稽留热、弛张热、间歇热、波状热、回归热、不规则热）",
    "发热前有无畏寒、寒战？",
    "体温上升是骤升型（几小时内达高峰）还是缓升型（数日内达高峰）？",
    "发热是否伴有出汗？出汗在发热的哪个阶段（高热期或体温下降期）？",
    "是否伴有咳嗽、咳痰、胸痛、呼吸困难？（提示呼吸系统感染）",
    "是否伴有腹痛、腹泻、恶心、呕吐？（提示消化系统感染）",
    "是否伴有尿频、尿急、尿痛、腰痛？（提示泌尿系统感染）",
    "是否伴有皮疹？皮疹的形态和分布？",
    "是否伴有头痛、呕吐、意识障碍？（提示中枢神经系统感染）",
    "是否伴有淋巴结肿大或肝脾肿大？",
    "是否伴有皮肤黏膜出血、瘀斑？",
    "是否伴有关节肿痛？",
    "是否有近期外出旅行史、传染病接触史、手术史、外伤史？",
    "是否服用过某些药物（如抗生素、解热药、糖皮质激素）？",
    "有无免疫系统疾病、血液病、恶性肿瘤病史？",
    "有无结缔组织病史（如系统性红斑狼疮、类风湿关节炎）？",
    "有无结核病史或结核接触史？",
    "有无动物接触史、蚊虫叮咬史？",
    "女性患者是否处于月经期、妊娠期或产褥期？",
    "发热与季节有无关系？（如夏季低热）"
  ],
  "associatedSymptoms": [
    "伴寒战（见于大叶性肺炎、败血症、急性胆囊炎、急性肾盂肾炎、流行性脑脊髓膜炎、疟疾、钩端螺旋体病、药物热、急性溶血或输血反应等）",
    "伴结膜充血（见于麻疹、流行性出血热、斑疹伤寒、钩端螺旋体病等）",
    "伴单纯疱疹（口唇单纯疱疹见于大叶性肺炎、流行性脑脊髓膜炎、间日疟、流行性感冒等）",
    "伴淋巴结肿大（见于传染性单核细胞增多症、风疹、淋巴结结核、局灶性化脓性感染、丝虫病、白血病、淋巴瘤、转移癌等）",
    "伴肝脾肿大（见于传染性单核细胞增多症、病毒性肝炎、肝及胆道感染、布氏杆菌病、疟疾、结缔组织病、白血病、淋巴瘤、黑热病、急性血吸虫病等）",
    "伴出血（发热伴皮肤黏膜出血见于重症感染及某些急性传染病，如流行性出血热、病毒性肝炎、斑疹伤寒、败血症等；也可见于某些血液病，如急性白血病、再生障碍性贫血、恶性组织细胞病等）",
    "伴关节肿痛（见于败血症、猩红热、布氏杆菌病、风湿热、结缔组织病、痛风等）",
    "伴皮疹（见于麻疹、猩红热、风疹、水痘、斑疹伤寒、风湿热、结缔组织病、药物热等）",
    "伴昏迷（先发热后昏迷者见于流行性乙型脑炎、斑疹伤寒、流行性脑脊髓膜炎、中毒性菌痢、中暑等；先昏迷后发热者见于脑出血、巴比妥类药物中毒等）"
  ],
  "redFlags": [
    "超高热（体温>41℃），尤其伴有意识障碍（可能导致脑损伤）",
    "发热伴严重头痛、颈强直、畏光（提示脑膜炎或蛛网膜下腔出血）",
    "发热伴呼吸窘迫、低氧血症（提示重症肺炎、ARDS等）",
    "发热伴休克表现（血压下降、四肢湿冷、尿少）",
    "发热伴全身广泛出血倾向（警惕流行性出血热、败血症DIC、血液系统恶性肿瘤）",
    "发热伴急性意识障碍、抽搐（提示颅内感染或代谢性脑病）",
    "发热伴严重免疫功能低下（如化疗后、器官移植后、HIV感染）",
    "发热伴急性溶血表现（寒战、高热、腰背痛、血红蛋白尿）",
    "发热伴进行性肝脾淋巴结肿大、恶病质（警惕恶性肿瘤、血液病）",
    "发热伴心脏杂音、栓塞表现（警惕感染性心内膜炎）",
    "新生儿或婴儿发热（易迅速进展为严重感染）",
    "不明原因发热（FUO）持续>3周，经初步检查仍未明确诊断"
  ],
  "physicalSigns": [
    "准确测量体温：记录最高体温、热型（最好有体温曲线图）",
    "皮肤黏膜检查：有无皮疹（形态、分布）、出血点、瘀斑、黄疸、单纯疱疹、结膜充血",
    "淋巴结检查：有无全身或局部淋巴结肿大（大小、质地、压痛、活动度）",
    "头颈部检查：有无咽部充血、扁桃体肿大及分泌物、颈强直",
    "心肺听诊：有无肺部啰音、心脏杂音、心包摩擦音",
    "腹部检查：有无肝脾肿大、压痛、反跳痛",
    "关节检查：有无肿胀、压痛、活动受限",
    "神经系统检查：意识状态、脑膜刺激征、病理反射",
    "测量血压、心率、呼吸频率：评估生命体征稳定性",
    "眼底检查：有无视乳头水肿（颅内高压）",
    "观察出汗情况：多汗或少汗"
  ]
}
