{
  "symptomKey": "obesity",
  "displayName": "肥胖",
  "requiredQuestions": [
    "体重和身高是多少？计算体重指数（BMI）。根据世界卫生组织标准：BMI≥30kg/m²为肥胖；我国标准：BMI≥28kg/m²为肥胖。",
    "是否有家族史或营养过度史？",
    "肥胖是均匀性还是向心性（腹型肥胖）？",
    "是否伴有饮水、进食、睡眠、智力精神异常？",
    "是否有食欲波动、血压易变、性功能减退、尿崩症？",
    "是否有溢乳、闭经？",
    "是否有满月脸、多血质外貌、皮肤紫纹、痤疮、高血压、骨质疏松？",
    "是否有颜面、下肢黏液性水肿？是否伴有表情呆滞、动作缓慢、畏寒少汗、便秘？",
    "是否有性功能丧失、闭经、不育？",
    "是否有皮下疼痛性结节？",
    "是否有头痛、颅骨板增生、精神症状？",
    "是否有通气功能减低、嗜睡、发绀、杵状指？",
    "是否有长期使用糖皮质激素、氯丙嗪、胰岛素等药物史？",
    "生活方式如何？包括饮食过量、进食行为异常、运动过少、饮酒等。",
    "是否有内分泌代谢性疾病史（如下丘脑、垂体疾病、库欣综合征、甲状腺功能减退症、性腺功能减退症、多囊卵巢综合征等）？",
    "女性患者是否有月经稀少、闭经、长期无排卵、不孕？",
    "是否有视力障碍、色素性视网膜病变？",
    "是否有智力障碍、生殖器发育不良、多指（趾）畸形？",
    "是否有骨骼畸形（如肘外翻、膝内翻）？",
    "是否有呼吸系统症状（如睡眠呼吸暂停）？"
  ],
  "associatedSymptoms": [
    "伴有家族史或营养过度（常为单纯性肥胖）",
    "伴有饮水、进食、睡眠及智力精神异常（可见于下丘脑性肥胖）",
    "伴有食欲波动、血压易变、性功能减退及尿崩症（可见于间脑性肥胖）",
    "伴有溢乳、闭经（可见于垂体性肥胖）",
    "伴有满月脸、多血质外貌的向心性肥胖（可见于库欣综合征）",
    "伴有颜面、下肢黏液性水肿（可见于甲状腺功能减退症）",
    "伴有性功能丧失、闭经不育（可见于肥胖型生殖无能症、双侧多囊卵巢综合征）",
    "伴有皮下疼痛性结节（可见于痛性肥胖综合征）",
    "伴有头痛、颅骨板增生、精神症状（可见于颅骨内板增生症）",
    "伴有通气功能减低、嗜睡、发绀、杵状指（可见于肥胖-通气不良综合征）",
    "伴有色素性视网膜退行性变、多指（趾）畸形、智力障碍、生殖器发育不良（可见于性幼稚-色素性视网膜炎-多指（趾）畸形综合征）",
    "伴有长期渐进性月经稀少、闭经、长期无排卵、多年不育（可见于双侧多囊卵巢综合征）",
    "伴有停经过早或性功能减退（可见于痛性肥胖综合征）",
    "伴有表情呆滞、动作缓慢、畏寒少汗、便秘（可见于甲状腺功能减退症）",
    "伴有血压升高、皮肤紫纹、痤疮、骨质疏松（可见于库欣综合征）"
  ],
  "redFlags": [
    "肥胖伴进行性呼吸困难、发绀、嗜睡（警惕肥胖-通气不良综合征，可能导致呼吸衰竭）",
    "肥胖伴严重高血压、难以控制的高血糖（警惕代谢综合征，增加心脑血管风险）",
    "肥胖伴突发剧烈头痛、视力障碍、意识改变（警惕颅内高压或垂体卒中）",
    "肥胖伴严重水肿、少尿、肾功能损害（警惕肾病综合征或甲状腺功能减退性心肌病）",
    "肥胖伴心悸、胸痛、活动耐力明显下降（警惕冠心病、心力衰竭）",
    "肥胖伴严重低氧血症、高碳酸血症（需警惕睡眠呼吸暂停综合征导致猝死）",
    "肥胖伴精神异常、行为改变（警惕下丘脑或垂体病变）",
    "肥胖伴进行性体重增加、顽固性低血钾、高血压（警惕原发性醛固酮增多症或库欣综合征）",
    "肥胖伴急性腹痛、恶心、呕吐（警惕急性胰腺炎、胆石症等肥胖相关急腹症）",
    "肥胖伴下肢不对称肿胀、疼痛（警惕深静脉血栓形成）",
    "肥胖伴严重皮肤感染、不易愈合的溃疡（警惕免疫功能低下）",
    "肥胖伴进行性肌无力、活动受限（警惕肥胖相关肌病或甲状腺功能减退）",
    "儿童或青少年肥胖伴发育迟缓、智力障碍、性发育异常（警惕遗传代谢性疾病）"
  ],
  "physicalSigns": [
    "测量身高、体重，计算体重指数（BMI）。测量腰围、臀围，计算腰臀比。",
    "观察肥胖类型：均匀性肥胖、向心性肥胖（腹型肥胖）、臀型肥胖。",
    "检查有无满月脸、多血质外貌、水牛背、锁骨上脂肪垫（库欣综合征体征）。",
    "检查皮肤有无紫纹（尤其腹部、大腿）、痤疮、多毛、色素沉着。",
    "检查有无颜面、下肢黏液性水肿（非凹陷性水肿），皮肤是否黄白粗厚。",
    "检查有无皮下疼痛性结节（痛性肥胖综合征）。",
    "检查有无骨骼畸形：肘外翻、膝内翻（肥胖型生殖无能症），多指（趾）畸形。",
    "眼科检查：有无色素性视网膜退行性变。",
    "测量血压，注意有无高血压。",
    "心血管系统检查：有无心界扩大、心律失常、心力衰竭体征。",
    "呼吸系统检查：有无呼吸频率增快、发绀、杵状指，听诊有无湿啰音。",
    "神经系统检查：有无智力障碍、精神异常、病理反射。",
    "生殖系统检查：男性有无生殖器发育不良、隐睾；女性有无阴毛分布异常、多囊卵巢体征（如卵巢增大）。",
    "甲状腺检查：有无甲状腺肿大、结节。",
    "腹部检查：有无肝脾肿大（脂肪肝可能）。",
    "关节检查：有无关节疼痛、活动受限（骨关节炎）。",
    "评估睡眠呼吸情况：有无打鼾、呼吸暂停。"
  ]
}